jlab-sensing/ENTS-node-firmware/stm32/lib/solenoid/src/solenoid.c
/**
 ******************************************************************************
 * @file    solenoid.c
 * @author  Caden Jacobs
 *
 * @brief   This library is designed to communicate with a solenoid to open and
 *          close it based on GPIO pins
 *          https://www.orbitonline.com/products/solenoids?variant=45109892612264&country=US&currency=USD&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&utm_source=paid+search&utm_medium=google+ads&utm_campaign=core+shopping&gad_source=1&gad_campaignid=19652308266&gbraid=0AAAAACw56Spsna6BxGUmTXQEtBiAdD4xG&gclid=CjwKCAjw-svEBhB6EiwAEzSdrsAHw1dSYI86-bRo6kxv42twG7OPn3huLm-9Bx99XAEWvaCfzjyhmxoCmnAQAvD_BwE
 * @date    8/6/2025
 ******************************************************************************
 */

#include "solenoid.h"
#include "utilities_def.h"
#include "stm32_seq.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "stm32wlxx_hal_def.h"

static StatusSolenoid Solenoid;

void SolenoidInit() {
  __HAL_RCC_GPIOA_CLK_ENABLE();  // Enable GPIOA clock

  // Use Pin PA10 to toggle solenoid
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  GPIO_InitStruct.Pin = GPIO_PIN_10;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;  // Push-pull output
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

  // Set up interrupt
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  // Init state of Solenoid
  SolenoidClose();
  Solenoid = SOLENOID_OFF;

}

void SolenoidOpen(void) {
  printf("SOLENOID_OPEN: Setting PA10 to HIGH (Relay ON)\n");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_10, GPIO_PIN_SET);  // HIGH = Relay ON
  Solenoid = SOLENOID_ON;
}

void SolenoidClose(void) {
  printf("SOLENOID_CLOSE: Setting PA10 to LOW (Relay OFF)\n");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_10, GPIO_PIN_RESET);  // LOW = Relay OFF
  Solenoid = SOLENOID_OFF;
}


/* Private funct*/
// static void SolenoidUpdate(void);

// void SolenoidUpdate(void)
// {
//   // TODO parse the files from downlink.c/h into here, for now it is just a simple toggle
//   if(Solenoid == SOLENOID_OFF)
//   {
//     SolenoidOpen();
//   } else if (Solenoid == SOLENOID_ON)
//   {
//     SolenoidClose();
//   }
// }